hffl-api/app/controllers/api/v1/franchises_controller.rb

    def index
        franchises = Franchise.all
---
SELECT "franchises".* FROM "franchises"

    def show
        franchise = Franchise.find(params[:id])
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]