hffl-api/app/controllers/api/v1/players_controller.rb

SELECT "players".* FROM "players"
---
    def index
        players = Player.all